request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getDebtorItemRequest>
         <gs:customerId>Spain</gs:customerId>
      </gs:getDebtorItemRequest>
   </soapenv:Body>
</soapenv:Envelope>
